source/_posts/2016-04-29-rails-split-engine.html
---
title: "rails engine 拆分业务方案"
date: 2016-04-29
layout: post
categories: 
- ruby
tags: 
- ruby 
- rails
published: true
comments: true
---
<p>
最近随着业务需要，需要对耦合在一起的任务进行拆分，正式发布之前这里记录一下拆分思路。
有一些和业务相关的内容，已经采用正则替换。^-^
</p>

<p>
<!-- more -->
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">项目发展背景</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
简单介绍下背景，在创业公司采用了ror 做最早的api。
之后随着业务发展，逐步增加sso 模块；后台admin模块；聊天im模块；推荐recommend模块；dev 调试模块，最近又新增了1个微信分享的share模块。
可预见的未来还会有其他业务模块继续增加。
</p>

<p>
业务越来越复杂细化，代码越来越多，后端开发人数从原来2人增加到接近10人。
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">面临挑战</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
后台是用1个代码库的。
虽然我们在业务设计时候是遵循正交设计。但是实际很多模块之间复用了一些公共代码.公共代码里面耦合了业务实现。
早期用着很爽，随着时间慢慢暴露因为耦度高导致改动成本很大的现实！
</p>

<p>
尽管我们有单元测试，但是改动起来各种单元测试报错，已经很难揣测最早的设计意图了。
现实情况是经常遇到开发1个模块的功能，需要考虑其他几个模块实现。
</p>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">升级方案</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
经过讨论得出我们现在到了业务发展，需要拆分子系统来满足这个阶段的业务和为下1个阶段进行铺垫。
</p>

<p>
拆分子系统目前大家比较公认的是微服务方案。
</p>

<p>
在权衡微服务方案过程中，考虑到实现微服务方案有很比较大的成本，服务发现和异常处理。这个是长期的事情。
在这之前，业务是一定要拆分的。继续找方案，发现rails 提供了业务层的拆分方案。rails engine方案，
rails engine方案可以对同1个项目内的代码进行组织成不同的模块实现业务上的拆分。
</p>

<p>
具体拆分方案如下
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">模块</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Core</td>
<td class="org-left">核心模型</td>
</tr>

<tr>
<td class="org-left">Api</td>
<td class="org-left">api</td>
</tr>

<tr>
<td class="org-left">Admin</td>
<td class="org-left">后台管理</td>
</tr>

<tr>
<td class="org-left">sso</td>
<td class="org-left">单点登陆</td>
</tr>

<tr>
<td class="org-left">recommand</td>
<td class="org-left">推荐模块</td>
</tr>

<tr>
<td class="org-left">dev</td>
<td class="org-left">工程师调试模块</td>
</tr>

<tr>
<td class="org-left">share</td>
<td class="org-left">分享活动模块</td>
</tr>
</tbody>
</table>


<br>
<p>
发布上线系统
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">系统</th>
<th scope="col" class="org-left">模块</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Api</td>
<td class="org-left">Api + Core</td>
<td class="org-left">客户端请求api</td>
</tr>

<tr>
<td class="org-left">Admin</td>
<td class="org-left">Admin + Core</td>
<td class="org-left">运维人员</td>
</tr>

<tr>
<td class="org-left">sso</td>
<td class="org-left">sso + Core</td>
<td class="org-left">单点验证登陆</td>
</tr>

<tr>
<td class="org-left">recommand</td>
<td class="org-left">Recommand</td>
<td class="org-left">推荐算法</td>
</tr>

<tr>
<td class="org-left">share</td>
<td class="org-left">share + Core</td>
<td class="org-left">分享活动页面</td>
</tr>
</tbody>
</table>

<br>
<p>
拆分方案以后，每个系统可以独立发布，快速迭代上线。毕竟我们是用ror 开发，是创业型公司，这很重要。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">方案明细</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
方案明确以后需要具体落实。
</p>

<p>
拆分Rails Engine并不复杂。详情可以<a href="http://api.rubyonrails.org/">点我</a>。
</p>

<p>
在具体操作过程中，需要注意如下几点
</p>

<ul class="org-ul">
<li>1</li>
<li>2</li>

<li>11</li>
<li>22</li>

<li>功能究竟放在哪个模块比较合适</li>
<li>代码究竟放在哪个结构下更合适</li>
<li>不兼容部分如何处理。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">最大问题</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
在明确了拆分细节以后，通过调研demo 很快演示了拆分的可行性。
下面要考虑的问题来了。
简单描述下问题是
</p>

<p>
<b>如何在高速行驶的告诉公路上不停车进行换轮胎？</b>
</p>

<p>
问题具体描述是
</p>

<ol class="org-ol">
<li>功能在继续开发</li>
<li>测试童鞋在测试上1个迭代的测试</li>
<li>正式环境切换</li>
<li>对用户和其他开发者无感知,无缝更新</li>
</ol>

<p>
权衡最后采用如下步骤
</p>

<ol class="org-ol">
<li>对demo 环境进行全面测试，处理方案明细中的注意事项，列出明细</li>
<li>对development 环境进行短暂冻结，快速拆分</li>
<li>对release后续的所有更新，采用人工方式，合并到development分支中</li>
<li>下一迭代合并到release 分支进入测试</li>
<li>下下迭代进入master 分支，真正拆分多个服务</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6">总结</h2>
<div class="outline-text-2" id="text-orgheadline6">
<p>
本篇文章属于强行写下来公开的1个技术决策过程。后续考虑写1个系列。
</p>
</div>
</div>
